Masmiseim36/iMXRT/targets/iMXRT/Loader2/drivers/iMXRT700/fsl_clock.c
    if ((CLKCTL1->SENSEDSPCPUCLKSEL & CLKCTL1_SENSEDSPCPUCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL1->SENSEDSPCPUCLKSEL) & CLKCTL1_SENSEDSPCPUCLKSEL_SEL_MASK)
        {
            case CLKCTL1_SENSEDSPCPUCLKSEL_SEL(0):
                freq = CLOCK_GetSenseBaseClkFreq();
                break;

            case CLKCTL1_SENSEDSPCPUCLKSEL_SEL(1):
                freq = CLOCK_GetFroClkFreq(2U);
                break;

            case CLKCTL1_SENSEDSPCPUCLKSEL_SEL(2):
                freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd1);
                break;

            case CLKCTL1_SENSEDSPCPUCLKSEL_SEL(3):
                freq = CLOCK_GetFroClkFreq(1U);
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL1->SENSEDSPCPUCLKDIV & CLKCTL1_SENSEDSPCPUCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetSenseAudioClkFreq(void)
{
    uint32_t freq = 0U;

    switch (CLKCTL1->AUDIOVDD1CLKSEL & CLKCTL1_AUDIOVDD1CLKSEL_SEL_MASK)
    {
        case CLKCTL1_AUDIOVDD1CLKSEL_SEL(0U):
            freq = CLOCK_GetMclkInClkFreq();
            break;
        case CLKCTL1_AUDIOVDD1CLKSEL_SEL(1U):
            freq = CLOCK_GetXtalInClkFreq();
            break;
        case CLKCTL1_AUDIOVDD1CLKSEL_SEL(2U):
            freq = CLOCK_GetFroClkFreq(2U) / 8U;
            break;
        case CLKCTL1_AUDIOVDD1CLKSEL_SEL(3U):
            freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd3);
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

#endif /* FSL_CLOCK_DRIVER_SENSE */

uint32_t CLOCK_GetSenseMainClkFreq(void)
{
    uint32_t freq = 0U;

    switch ((CLKCTL3->MAINCLKSEL) & CLKCTL3_MAINCLKSEL_SEL_MASK)
    {
        case CLKCTL3_MAINCLKSEL_SEL(0):
            freq = CLOCK_GetSenseBaseClkFreq();
            break;

        case CLKCTL3_MAINCLKSEL_SEL(1):
            freq = CLOCK_GetFroClkFreq(2U);
            break;

        case CLKCTL3_MAINCLKSEL_SEL(2):
            freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd3);
            break;

        case CLKCTL3_MAINCLKSEL_SEL(3):
            freq = CLOCK_GetFroClkFreq(1U);
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ((CLKCTL3->SENSEMAINCLKDIV & CLKCTL3_SENSEMAINCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetVdd2MediaBaseClkFreq(void)
{
    uint32_t freq = 0U;

    switch ((CLKCTL4->MD2BASECLKSEL) & CLKCTL4_MD2BASECLKSEL_SEL_MASK)
    {
        case CLKCTL4_MD2BASECLKSEL_SEL(0):
            freq = CLOCK_GetFroClkFreq(1U) / 3U;
            break;

        case CLKCTL4_MD2BASECLKSEL_SEL(1):
            freq = CLOCK_GetFroClkFreq(1U);
            break;

        case CLKCTL4_MD2BASECLKSEL_SEL(2):
            freq = CLOCK_GetFroClkFreq(0U) / 3U;
            break;

        case CLKCTL4_MD2BASECLKSEL_SEL(3):
            freq = CLOCK_GetLpOscFreq();
            break;

        default:
            freq = 0U;
            break;
    }

    return freq;
}

uint32_t CLOCK_GetVddnMediaBaseClkFreq(void)
{
    uint32_t freq = 0U;

    switch ((CLKCTL4->MDNBASECLKSEL) & CLKCTL4_MDNBASECLKSEL_SEL_MASK)
    {
        case CLKCTL4_MDNBASECLKSEL_SEL(0):
            freq = CLOCK_GetFroClkFreq(1U) / 3U;
            break;

        case CLKCTL4_MDNBASECLKSEL_SEL(1):
            freq = CLOCK_GetFroClkFreq(1U);
            break;

        case CLKCTL4_MDNBASECLKSEL_SEL(2):
            freq = CLOCK_GetFroClkFreq(0U) / 3U;
            break;

        case CLKCTL4_MDNBASECLKSEL_SEL(3):
            freq = CLOCK_GetLpOscFreq();
            break;

        default:
            freq = 0U;
            break;
    }

    return freq;
}

uint32_t CLOCK_GetMediaMainClkFreq(void)
{
    uint32_t freq = 0U;

    switch ((CLKCTL4->MEDIAMAINCLKSEL) & CLKCTL4_MEDIAMAINCLKSEL_SEL_MASK)
    {
        case CLKCTL4_MEDIAMAINCLKSEL_SEL(0):
            freq = CLOCK_GetVdd2MediaBaseClkFreq();
            break;

        case CLKCTL4_MEDIAMAINCLKSEL_SEL(1):
            freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd0);
            break;

        case CLKCTL4_MEDIAMAINCLKSEL_SEL(2):
            freq = CLOCK_GetFroClkFreq(0U);
            break;

        case CLKCTL4_MEDIAMAINCLKSEL_SEL(3):
            freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd2);
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ((CLKCTL4->MEDIAMAINCLKDIV & CLKCTL4_MEDIAMAINCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetMediaVddnClkFreq(void)
{
    uint32_t freq = 0U;

    switch ((CLKCTL4->MEDIAVDDNCLKSEL) & CLKCTL4_MEDIAVDDNCLKSEL_SEL_MASK)
    {
        case CLKCTL4_MEDIAVDDNCLKSEL_SEL(0):
            freq = CLOCK_GetVddnMediaBaseClkFreq();
            break;

        case CLKCTL4_MEDIAVDDNCLKSEL_SEL(1):
            freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd0);
            break;

        case CLKCTL4_MEDIAVDDNCLKSEL_SEL(2):
            freq = CLOCK_GetFroClkFreq(0U);
            break;

        case CLKCTL4_MEDIAVDDNCLKSEL_SEL(3):
            freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd2);
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ((CLKCTL4->MEDIAVDDNCLKDIV & CLKCTL4_MEDIAVDDNCLKDIV_DIV_MASK) + 1U);
}

/*! @brief  Enable/Disable FRO2 clock output. */
void CLOCK_EnableFro2ClkForDomain(uint32_t domainEnable)
{
    if (domainEnable != 0U)
    {
        /* Wait FRO stable first in case FRO just get powered on. */
        while ((CLKCTL3->FRO2CLKSTATUS & CLKCTL3_FRO2CLKSTATUS_CLK_OK_MASK) == 0U)
        {
        }
    }
    else
    {
        /* Do nothing */
    }
    CLKCTL3->FRO2MAXDOMAINEN = domainEnable & (uint32_t)kCLOCK_AllDomainEnable;
}

void CLOCK_EnableMainPllPfdClkForDomain(clock_pfd_t pfd, uint32_t domainEnable)
{
    uint32_t pfdIndex = (uint32_t)pfd;
    uint32_t pfdValue;

    pfdValue = CLKCTL2->MAINPLL0PFDDOMAINEN & (~(0x7FUL << (8UL * pfdIndex)));

    CLKCTL2->MAINPLL0PFDDOMAINEN = pfdValue | ((domainEnable & (uint32_t)kCLOCK_AllDomainEnable) << (8UL * pfdIndex));
}

void CLOCK_EnableAudioPllPfdClkForDomain(clock_pfd_t pfd, uint32_t domainEnable)
{
    uint32_t pfdIndex = (uint32_t)pfd;
    uint32_t pfdValue;

    pfdValue = CLKCTL2->AUDIOPLL0PFDDOMAINEN & (~(0x7FUL << (8UL * pfdIndex)));

