Masmiseim36/iMXRT/targets/iMXRT/Loader2/drivers/iMXRT700/fsl_clock.c
        freq = freq / ((CLKCTL4->LPSPI16CLKDIV & CLKCTL4_LPSPI16CLKDIV_DIV_MASK) + 1U);
    }
    else
    {
        freq = CLOCK_GetLPFlexCommClkFreq(id);
    }

    return freq;
}

uint32_t CLOCK_GetLPI2cClkFreq(uint32_t id)
{
    uint32_t freq = 0U;

    if (id != 15U)
    {
        freq = CLOCK_GetLPFlexCommClkFreq(id);
    }
    else
    {
        if ((CLKCTL3->LPI2C15FCLKSEL & CLKCTL3_LPI2C15FCLKSEL_SEL_EN_MASK) != 0U)
        {
            switch ((CLKCTL3->LPI2C15FCLKSEL) & CLKCTL3_LPI2C15FCLKSEL_SEL_MASK)
            {
                case CLKCTL3_LPI2C15FCLKSEL_SEL(0):
                    freq = CLOCK_GetSenseBaseClkFreq();
                    break;

                case CLKCTL3_LPI2C15FCLKSEL_SEL(1):
                    freq = CLOCK_GetFroClkFreq(1U);
                    break;

                case CLKCTL3_LPI2C15FCLKSEL_SEL(2):
                    freq = CLOCK_GetFroClkFreq(1U) / 2U;
                    break;

                case CLKCTL3_LPI2C15FCLKSEL_SEL(3):
                    freq = CLOCK_GetFroClkFreq(2U);
                    break;

                default:
                    freq = 0U;
                    break;
            }
        }
        freq = freq / ((CLKCTL3->LPI2C15FCLKDIV & CLKCTL3_LPI2C15FCLKDIV_DIV_MASK) + 1U);
    }

    return freq;
}

uint32_t CLOCK_GetLcdifClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL4->LCDIFPIXELCLKSEL & CLKCTL4_LCDIFPIXELCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL4->LCDIFPIXELCLKSEL) & CLKCTL4_LCDIFPIXELCLKSEL_SEL_MASK)
        {
            case CLKCTL4_LCDIFPIXELCLKSEL_SEL(0):
                freq = CLOCK_GetVdd2MediaBaseClkFreq();
                break;

            case CLKCTL4_LCDIFPIXELCLKSEL_SEL(1):
                freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd2);
                break;

            case CLKCTL4_LCDIFPIXELCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(0U);
                break;

            case CLKCTL4_LCDIFPIXELCLKSEL_SEL(3):
                freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd1);
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL4->LCDIFPIXELCLKDIV & CLKCTL4_LCDIFPIXELCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetMipiDphyClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL4->DPHYCLKSEL & CLKCTL4_DPHYCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL4->DPHYCLKSEL) & CLKCTL4_DPHYCLKSEL_SEL_MASK)
        {
            case CLKCTL4_DPHYCLKSEL_SEL(0):
                freq = CLOCK_GetVdd2MediaBaseClkFreq();
                break;

                /*Source select 1 is internal. */

            case CLKCTL4_DPHYCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(0U);
                break;

            case CLKCTL4_DPHYCLKSEL_SEL(3):
                freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd2);
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL4->DPHYCLKDIV & CLKCTL4_DPHYCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetMipiDphyEscRxClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL4->DPHYESCCLKSEL & CLKCTL4_DPHYESCCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL4->DPHYESCCLKSEL) & CLKCTL4_DPHYESCCLKSEL_SEL_MASK)
        {
            case CLKCTL4_DPHYESCCLKSEL_SEL(0):
                freq = CLOCK_GetVdd2MediaBaseClkFreq();
                break;

            case CLKCTL4_DPHYESCCLKSEL_SEL(1):
                freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd1);
                break;

            case CLKCTL4_DPHYESCCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(0U);
                break;

            case CLKCTL4_DPHYESCCLKSEL_SEL(3):
                freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd2);
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL4->DPHYESCRXCLKDIV & CLKCTL4_DPHYESCRXCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetMipiDphyEscTxClkFreq(void)
{
    return CLOCK_GetMipiDphyEscRxClkFreq() / ((CLKCTL4->DPHYESCTXCLKDIV & CLKCTL4_DPHYESCTXCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetUsdhcClkFreq(uint32_t id)
{
    uint32_t freq = 0U;

    if (id == 0U)
    {
        if ((CLKCTL4->SDIO0FCLKSEL & CLKCTL4_SDIO0FCLKSEL_SEL_EN_MASK) != 0U)
        {
            switch ((CLKCTL4->SDIO0FCLKSEL) & CLKCTL4_SDIO0FCLKSEL_SEL_MASK)
            {
                case CLKCTL4_SDIO0FCLKSEL_SEL(0):
                    freq = CLOCK_GetVddnMediaBaseClkFreq();
                    break;

                case CLKCTL4_SDIO0FCLKSEL_SEL(1):
                    freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd0);
                    break;

                case CLKCTL4_SDIO0FCLKSEL_SEL(2):
                    freq = CLOCK_GetFroClkFreq(0U);
                    break;

                case CLKCTL4_SDIO0FCLKSEL_SEL(3):
                    freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd2);
                    break;

                default:
                    freq = 0U;
                    break;
            }
            freq = freq / ((CLKCTL4->SDIO0FCLKDIV & CLKCTL4_SDIO0FCLKDIV_DIV_MASK) + 1U);
        }
    }
    else if (id == 1U)
    {
        if ((CLKCTL4->SDIO1FCLKSEL & CLKCTL4_SDIO1FCLKSEL_SEL_EN_MASK) != 0U)
        {
            switch ((CLKCTL4->SDIO1FCLKSEL) & CLKCTL4_SDIO1FCLKSEL_SEL_MASK)
            {
                case CLKCTL4_SDIO1FCLKSEL_SEL(0):
                    freq = CLOCK_GetVddnMediaBaseClkFreq();
                    break;

                case CLKCTL4_SDIO1FCLKSEL_SEL(1):
                    freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd0);
                    break;

                case CLKCTL4_SDIO1FCLKSEL_SEL(2):
                    freq = CLOCK_GetFroClkFreq(0U);
                    break;

                case CLKCTL4_SDIO1FCLKSEL_SEL(3):
                    freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd2);
                    break;

                default:
                    freq = 0U;
                    break;
            }
            freq = freq / ((CLKCTL4->SDIO1FCLKDIV & CLKCTL4_SDIO1FCLKDIV_DIV_MASK) + 1U);
        }
    }
    else
    {
        /* Nothing.*/
    }

    return freq;
}

uint32_t CLOCK_GetVgpuClkFreq(void)
{
    uint32_t freq = 0U;

